app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hey boo"], ["picture", "Intropic.jpg"], ["user_id", 1], ["created_at", "2016-12-20 12:00:15.480618"], ["updated_at", "2016-12-20 12:00:15.480618"]]
---
	def create
		@micropost = current_user.microposts.build(micropost_params)
    		if @micropost.save